// FETCH СПЕЦИАЛЬНЫЙ МЕТОД
// ОТПРАВЛЯЕТ ЗАПРОС НА СЕРВЕР
// GET - получаем данные с сервера
// метод fetch возвращает промис
// позволяет работать с асинхронным кодом
// есть какие-то задачи, которые занимают время
// запрос тяжелых данных
// запрос когда медленный

// fetch асинхронно запрашивает данные
// он не останавливают выполнения скрипта

// ответ который приходит с сервера
// у него есть встроенные методы
// в зависимости от типа данных я могу распарсить различными методами
// JSON распарсил методом .json()
// возвращать еще один промис
// следующий .then() обрабатывает предудщий промис
// ответ промиса вывожу в консоль

// document
// JSON
